{
  "meta": {
    "title": "Test Article",
    "date": "",
    "author": "",
    "tags": [],
    "category": [],
    "draft": false,
    "slug": "article-en-md"
  },
  "contentHtml": "<h1>Test Article</h1>\n<h2>1. Is ionization achieved through direct electron transfer or proton transfer?</h2>\n<p><strong>Answer: Both exist, depending on the ionization technique used.</strong></p>\n<p>The essence of mass spectrometry ionization is to impart charge to neutral molecules, turning them into charged ions (positive or negative ions) so that they can move and be detected in magnetic or electric fields. Charge introduction primarily occurs in two ways:</p>\n<ul>\n<li><p><strong>Electron transfer (direct gain or loss of electrons):</strong></p>\n<ul>\n<li><strong>Typical example: Electron Impact Ionization Source (EI).</strong> Under vacuum conditions, high-energy electrons (typically 70 eV) emitted from a tungsten filament bombard vaporized sample molecules. After being bombarded, the molecule may directly lose an electron, forming a positively charged molecular ion (M⁺•).</li>\n<li><code>M + e⁻ → M⁺• + 2e⁻</code></li>\n<li>This process is high-energy and can easily cause chemical bond cleavage, producing many fragment ions.</li>\n</ul>\n</li>\n<li><p><strong>Proton transfer (gain/loss of protons):</strong></p>\n<ul>\n<li><strong>Typical examples: Electrospray Ionization Source (ESI) and Atmospheric Pressure Chemical Ionization Source (APCI).</strong> These are &quot;soft ionization&quot; techniques, more commonly used in life sciences (e.g., metabolomics, proteomics).</li>\n<li>In ESI, during the continuous evaporation and Coulombic explosion of charged droplets, <strong>protons (H⁺) are ultimately transferred to the analyte molecule</strong>, forming adduct ions such as <code>[M+H]⁺</code> (positive ion mode) or are removed from the molecule, forming <code>[M-H]⁻</code> (negative ion mode).</li>\n<li><code>M + H⁺ → [M+H]⁺</code> (positive ion mode)</li>\n<li><code>M - H⁺ → [M-H]⁻</code> (negative ion mode)</li>\n<li>Additionally, other cations may be adducted, such as <code>[M+Na]⁺</code>, <code>[M+NH₄]⁺</code>, etc.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Summary:</strong> Traditional EI sources primarily achieve ionization through <strong>electron transfer</strong>; whereas modern soft ionization techniques (e.g., ESI, APCI, MALDI) mainly form ions through <strong>proton transfer</strong> or adduct formation (e.g., with Na⁺).</p>\n<hr>\n<h2>2. How to ensure quantitative accuracy?</h2>\n<p>The instability of ionization degree (i.e., ionization efficiency) is one of the main challenges in mass spectrometry quantitative analysis. The ionization efficiency of the same molecule can vary significantly across different matrices and at different time points. To address this issue, scientists employ the following core strategies to ensure quantitative accuracy:</p>\n<ol>\n<li><p><strong>Internal Standard (IS) Method: This is the most core and effective method.</strong></p>\n<ul>\n<li><strong>Stable Isotope-Labeled Internal Standard (Stable Isotope-Labeled IS):</strong> This is the gold standard. Use a compound with the exact same chemical structure as the analyte but with some atoms replaced by stable isotopes (e.g., ²H, ¹³C, ¹⁵N) as the internal standard (e.g., when detecting amino acids, use ¹³C-labeled versions of the same amino acid). Due to nearly identical chemical properties, the internal standard and analyte behave very similarly during sample preparation and ionization. Any factors causing fluctuations in ionization efficiency affect both the analyte and internal standard equally. By calculating the ratio of <strong>analyte peak area / internal standard peak area</strong>, errors due to ionization efficiency fluctuations can be greatly mitigated.</li>\n<li><strong>Structural Analog Internal Standard (Structural Analog IS):</strong> If an isotopic internal standard is unavailable, a compound with a structure very similar to the analyte is chosen as the internal standard, but its correction effect is not as perfect as that of the isotopic internal standard.</li>\n</ul>\n</li>\n<li><p><strong>Calibration Curve Method:</strong></p>\n<ul>\n<li>Prepare a series of standard solutions using known concentrations of standards, adding a <strong>fixed amount of internal standard</strong> to each.</li>\n<li>After instrument detection, plot a calibration curve (usually a linear regression curve) with the peak area ratio of analyte to internal standard as the y-axis and the standard concentration as the x-axis.</li>\n<li>The results of unknown samples are calculated using this curve to achieve quantification.</li>\n</ul>\n</li>\n<li><p><strong>Quality Control (QC) Samples:</strong></p>\n<ul>\n<li>Periodically insert QC samples prepared from pooled samples throughout the analytical batch. By monitoring the stability and precision of QC sample results, the reproducibility of the entire experimental process and the reliability of the data can be assessed.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Summary:</strong> The combination of <strong>stable isotope internal standard + calibration curve method</strong> can maximally correct errors caused by differences in ionization efficiency, sample preparation losses, instrument fluctuations, etc., thereby ensuring quantitative accuracy.</p>\n<hr>\n<h2>3. Which ionization sources are used for metabolomics and proteomics, respectively?</h2>\n<p>These two major omics fields currently heavily rely on <strong>soft ionization techniques</strong> to obtain intact molecular ion information.</p>\n<ul>\n<li><p><strong>Metabolomics:</strong></p>\n<ul>\n<li><strong>Primary Ionization Source: Electrospray Ionization Source (ESI).</strong> Due to its excellent &quot;soft&quot; characteristics, it efficiently produces <code>[M+H]⁺</code> or <code>[M-H]⁻</code> ions, making it very suitable for analyzing metabolites of varying polarity and small molecular weight (e.g., amino acids, organic acids, sugars, lipids, etc.). It is often coupled with liquid chromatography (LC), i.e., LC-ESI-MS.</li>\n<li><strong>Secondary Ionization Sources: Atmospheric Pressure Chemical Ionization Source (APCI)</strong> and <strong>Atmospheric Pressure Photoionization Source (APPI).</strong> APCI has good ionization efficiency for medium to non-polar small molecules (e.g., certain lipids, steroid hormones) and is more tolerant to salts and matrix effects than ESI.</li>\n</ul>\n</li>\n<li><p><strong>Proteomics:</strong></p>\n<ul>\n<li><strong>Primary Ionization Source: Electrospray Ionization Source (ESI).</strong> Especially nano-electrospray (nano-ESI), coupled with high-performance liquid chromatography (particularly nano-flow liquid chromatography, nLC), is the absolute mainstream technology for &quot;bottom-up&quot; proteomics (analysis of enzymatic peptides), known for its extremely high sensitivity.</li>\n<li><strong>Important Ionization Source: Matrix-Assisted Laser Desorption/Ionization Source (MALDI).</strong> Commonly used for &quot;peptide mass fingerprinting&quot; identification and imaging mass spectrometry (MSI). It is characterized by simple operation, fast speed, and good salt tolerance, often coupled with time-of-flight mass spectrometry (TOF) (MALDI-TOF/TOF).</li>\n</ul>\n</li>\n</ul>\n<hr>\n<h2>4. What are soft/hard ionization sources?</h2>\n<p>This classification is based on the amount of energy transferred to the molecule during ionization and whether it easily produces fragments.</p>\n<ul>\n<li><p><strong>Hard Ionization Source:</strong></p>\n<ul>\n<li><strong>Characteristics:</strong> The ionization process is high-energy, <strong>easily causing chemical bond cleavage in molecular ions, producing many fragment ions</strong>, while the abundance of the molecular ion itself (parent ion) may be weak or even undetectable.</li>\n<li><strong>Advantages:</strong> Fragment ions provide rich structural information, useful for structural elucidation of unknowns and spectral library searching.</li>\n<li><strong>Representative: Electron Impact Ionization Source (EI).</strong> The standard ionization source for GC-MS.</li>\n</ul>\n</li>\n<li><p><strong>Soft Ionization Source:</strong></p>\n<ul>\n<li><strong>Characteristics:</strong> The ionization process is gentle, <strong>mainly producing intact molecular ions (or proton adduct ions)</strong>, with few or no fragments.</li>\n<li><strong>Advantages:</strong> Very suitable for analyzing complex mixtures, large molecules (e.g., proteins, nucleic acids), and thermally unstable compounds, allowing direct acquisition of accurate molecular weight information.</li>\n<li><strong>Disadvantages:</strong> Lack of structural information, usually requiring tandem mass spectrometry (MS/MS) to induce fragmentation for structural information.</li>\n<li><strong>Representatives: Electrospray Ionization Source (ESI), Matrix-Assisted Laser Desorption/Ionization Source (MALDI), Atmospheric Pressure Chemical Ionization Source (APCI).</strong></li>\n</ul>\n</li>\n</ul>\n<hr>\n<h2>5. How to directly obtain the charge number of an ion?</h2>\n<p>For sources like ESI that can produce multi-charge ions, directly determining the charge number (z) of an ion is key to interpreting its molecular weight (M). There are two main methods:</p>\n<ol>\n<li><p><strong>Isotopic Peak Distribution Method (Isotopic Peak Distribution - the most direct method)</strong></p>\n<ul>\n<li><strong>Principle:</strong> Due to the natural isotopes of elements (e.g., carbon, hydrogen, nitrogen, sulfur, etc.), a molecular ion peak will consist of a cluster of isotopic peaks with a mass difference of 1 Da (e.g., ¹²C and ¹³C). <strong>The mass difference between adjacent isotopic peaks Δm = 1/z.</strong></li>\n<li><strong>Operation:</strong> On a high-mass resolution mass spectrum (e.g., Q-TOF, Orbitrap, FT-ICR), zoom in to observe a peak cluster.<ul>\n<li>Measure the mass difference (Δm) between two adjacent isotopic peaks (e.g., the monoisotopic peak and the M+1 peak).</li>\n<li>The charge number <strong>z = 1 / Δm</strong>.</li>\n</ul>\n</li>\n<li><strong>Example:</strong> If the measured mass difference between two peaks is 0.5 Da, then the charge number of the ion is z = 1 / 0.5 = <strong>2+</strong>.</li>\n</ul>\n</li>\n<li><p><strong>Charge Deconvolution Method</strong></p>\n<ul>\n<li><strong>Principle:</strong> The same molecule forms a series of ions with different charge numbers but the same mass (e.g., <code>[M+2H]²⁺</code>, <code>[M+3H]³⁺</code>, <code>[M+4H]⁴⁺</code>...). These ions are distributed on the m/z axis, but through mathematical algorithms, the <strong>neutral molecular weight (M)</strong> they collectively correspond to can be derived. Once M is calculated, combined with the m/z value of any one ion, its charge number z can be determined.</li>\n<li><strong>Formula:</strong> For an <code>[M+nH]ⁿ⁺</code> ion, <code>m/z = (M + n*1.007825) / n</code><ul>\n<li>m/z is the measured value</li>\n<li>M is the neutral molecular weight to be determined</li>\n<li>n is the charge number (also the number of added protons)</li>\n</ul>\n</li>\n<li><strong>Operation:</strong> Modern mass spectrometer software includes automatic &quot;deconvolution&quot; functions that can automatically identify multiple charge state peaks belonging to the same molecule and directly output its single-charge molecular weight M.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Summary:</strong> In today&#39;s high-resolution mass spectrometry, <strong>directly reading the charge number by analyzing the spacing of isotopic peaks</strong> is the most common and intuitive method.</p>\n<p>I hope the above detailed explanations help you fully understand these issues!</p>\n"
}